Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: Staged means that you have marked a modified file in its current version to go into your next commit snapshot.
cs: Připraveno k zapsání znamená, že jste změněný soubor v jeho aktuální verzi určili k tomu, aby byl zapsán do dalšího snímku (commit snapshot).

source: Staging the file marks it as resolved in Git.
cs: Připravením k zápisu se v Gitu soubor označí jako vyřešený.

source: Staging the files checksums each one (the SHA-1 hash we mentioned in <<_getting_started>>), stores that version of the file in the Git repository (Git refers to them as blobs), and adds that checksum to the staging area:
cs: Při přípravě souborů k zapsání je pro každý z nich vypočítán kontrolní součet (o otisku SHA-1 jsme se zmínili v kapitole <<_getting_started>>), daná verze souborů se uloží v repozitáři Gitu (Git jim říká bloby footnote:[Pozn. překl.: Z anglického Binary Large OBject, čili _velký binární objekt_.]) a přidá jejich kontrolní součet do oblasti připravených změn:

source: Start with the first tree you wrote:
cs: Začněte prvním stromem, který jste zapsali:

source: Submodules allow you to keep a Git repository as a subdirectory of another Git repository.
cs: Submoduly umožňují uchovávat repozitář Git jako podadresář jiného repozitáře Git.

source: Subversion can have only a single linear history, and confusing it is very easy.
cs: Subversion může mít pouze jednu lineární historii a opravdu není těžké uvést ho do rozpaků.

source: Such example on a Windows system may include a prematurely terminated Git operation during a Git initiated edit.
cs: V systému Windows to může například vést i k předčasnému ukončení operace Gitu, když bude Git editor spouštět.

source: Suffice it to say that this is rare.
cs: Je jasné, že to většinou nechcete.

source: Suppose you add a remote like this:
cs: Řekněme, že přidáte například tento vzdálený repozitář:

source: Suppose you clone from a central server and then do some work off that.
cs: Předpokládejme, že jste naklonovali z centrálního serveru a provedli jste několik změn.

source: Suppose you decide that you want to merge your client-side changes into your mainline for a release, but you want to hold off on the server-side changes until it's tested further.
cs: Předpokládejme, že nyní chcete změny straně klienta začlenit do své hlavní linie k vydání, ale prozatím chcete počkat se změnami na straně serveru, dokud nebudou víc otestovány.

source: Suppose you look at the history of your project:
cs: Můžete mít například takovouto historii projektu:

source: Suppose you want to add a mechanism that uses an access control list (ACL) that specifies which users are allowed to push changes to which parts of your projects.
cs: Předpokládejme, že chcete přidat mechanismus, který bude používat seznam oprávnění ACL (access control list), v němž bude stanoveno, kteří uživatelé smějí do které části vašeho projektu odesílat změny.

source: Suppose your commit history looks like this:
cs: Předpokládejme, že vaše historie revizí vypadá takto:

source: Suppose your history looks like the following: you created an `experiment` branch, did two commits, and then merged them back into `master`.
cs: Předpokládejme, že vaše historie vypadá následovně: vytvořili jste větev `experiment`, zapsali jste dvě revize a začlenili jste je zpět do větve `master`.

source: Suppose your repository contains the following branches and tags:
cs: Řekněme, že váš repozitář obsahuje tyto větve a značky:

source: Suppose you’re developing a web site and creating Atom feeds.
cs: Programujete webové stránky a vytváříte kanály Atom.

source: Suppose you’ve done an import from another source control system and have subdirectories that make no sense (trunk, tags, and so on).
cs: Předpokládejme, že jste dokončili import z jiného systému ke správě zdrojového kódu a máte podadresáře, které nedávají žádný smysl (trunk, tags apod.).

source: Switch back to your original story and continue working.
cs: Přepnete zpět na svůj původní případ a pokračujete v práci.

source: Switch to your production branch.
cs: Přepnete se na produkční větev.

source: Take a history like <<rbdiag_e>>, for example.
cs: Vezměme si například historii na obrázku <<rbdiag_e>>.

source: Technically, you can do that by explicitly figuring out the common ancestor and then running your diff on it:
cs: Můžete tedy explicitně najít společného předka obou větví a spustit na něm příkaz diff:

source: That approach lets you do more complex things like deny non-fast-forwards to a certain subset of users.
cs: Tato metoda umožňuje pokročilejší nastavení, jako zamítnutí jiných aktualizací než „rychle vpřed“ určité skupině uživatelů.

source: That change will be rejected until you merge in their work.
cs: Jejich změna bude odmítnuta, dokud nezačlení dříve odeslanou práci.

source: That command compares what is in your working directory with what is in your staging area.
cs: Tento příkaz porovná obsah vašeho pracovního adresáře s tím, co se nachází v oblasti připravených změn.

source: That command did two things.
cs: Příkaz provedl dvě věci.

source: That command does the same thing as the previous one, but the target directory is called `mylibgit`.
cs: Tento příkaz učiní totéž co příkaz předchozí, ale cílový adresář se bude jmenovat `mylibgit`.

source: That commit is when this file was first added to this project, and those lines have been unchanged since.
cs: Tato revize vznikla prvním přidáním tohoto souboru do projektu a tyto řádky zůstaly od té doby nezměněny.

source: That creates a directory named ``libgit2'', initializes a `.git` directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version.
cs: Tímto příkazem se vytvoří adresář s názvem `libgit2`, inicializuje se v něm podadresář `.git`, stáhnou se všechna data pro tento repozitář a vytvoří se pracovní kopie nejnovější verze.

source: That drops you into your text editor, which has your last commit message in it, ready for you to modify the message.
cs: Tím se přesunete do textového editoru, v němž bude otevřena vaše poslední zpráva k revizi. Nyní ji můžete upravit.

source: That gives you your next commit object.
cs: Tím získáte další objekt revize.

source: That is a simple example you're likely to encounter.
cs: S uvedeným jednoduchým případem se pravděpodobně setkáte.

source: That is a special mode in Git that basically means you’re recording a commit as a directory entry rather than a subdirectory or a file.
cs: Jedná se o speciální režim systému Git, který udává, že revizi zaznamenáváte jako adresář, ne jako podadresář nebo soubor.

source: That is a very useful syntax to remember.
cs: Určitě uděláte dobře, pokud si tuto syntaxi zapamatujete.

source: That is one of the simplest workflows.
cs: Toto je jeden z nejjednodušších pracovních postupů.

source: That is, you'll learn how to contribute code successfully to a project and make it as easy on you and the project maintainer as possible, and also how to maintain a project successfully with a number of developers contributing.
cs: Jinými slovy, naučíte se, jak lze do projektu úspěšně přidat vlastní kód, jak to co nejvíc usnadnit sobě i správci projektu a také to, jak se dá úspěšně udržovat projekt, do kterého přispívá velký počet vývojářů.

source: That means you can do things such as:
cs: To znamená, že můžete zadat příkaz jako:

source: That pulls down the work John has pushed up in the meantime.
cs: Tím stáhne práci, kterou mezitím odeslal John.

source: That returns an integer value for the date of each directory.
cs: Tím dostanete celé číslo pro data každého adresáře.

source: That shows the tagger information, the date the commit was tagged, and the annotation message before showing the commit information.
cs: Příkaz zobrazí informace o autorovi značky, datu, kdy byla revize označena, a zprávu značky ještě před informacemi o revizi.

source: That shows you where the branch tip was yesterday.
cs: Git vám ukáže, kde se vrchol větve nacházel včera.

source: That starts up an HTTPD server on port 1234 and then automatically starts a web browser that opens on that page.
cs: Tím spustíte HTTPD server na portu 1234 a automaticky se spustí webový prohlížeč, který otevře tuto stránku.

source: That way, the maintainer doesn't have to do any integration work – just a fast-forward or a clean apply.
cs: Správce v tomto případě nemusí provádět žádnou integraci, provede pouze posun „rychle vpřed“ nebo čistou aplikaci.

source: That way, they can correct any problems before committing and before those issues become more difficult to fix.
cs: Všechny problémy tak budou moci opravit, dokud to ještě není příliš složité a dokud je nezapsali do revize.

source: That way, you can use private branches for work you don't want to share, and push up only the topic branches you want to collaborate on.
cs: Tímto způsobem si můžete zachovat soukromé větve pro práci, kterou nehodláte sdílet, a odesílat pouze tématické větve, na nichž chcete spolupracovat.

source: That's how it happened, and the repository should preserve that for posterity.
cs: Takhle se to stalo a repozitář by to měl zachovat pro další generace.

source: That’s 1,200 times the number of grains of sand on the earth.
cs: To je 1200násobek počtu všech zrnek písku na celé Zemi.

source: The Git directory is where Git stores the metadata and object database for your project.
cs: Adresář Git je místo, kde Git uchovává metadata a databázi objektů vašeho projektu.

source: The Git project also has a `maint` branch that is forked off from the last release to provide backported patches in case a maintenance release is required.
cs: Projekt Git má kromě toho větev `maint`, která byla odštěpena z posledního vydání a představuje záplaty backportované pro případ, že by bylo třeba vydat opravnou verzi.

source: The Git project has well-formatted commit messages – try running `git log --no-merges` there to see what a nicely formatted project-commit history looks like.
cs: Projekt Git obsahuje kvalitně naformátované zprávy k revizím. Zkuste spustit `git log --no-merges`, abyste se podívali, jak vypadá pěkně naformátovaná historie revizí projektu.

source: The Git project provides a document that lays out a number of good tips for creating commits from which to submit patches – you can read it in the Git source code in the `Documentation/SubmittingPatches` file.
cs: Samotný projekt Git obsahuje dokument, v němž je navržena celá řada dobrých tipů pro vytváření revizí, z kterých se vytvářejí záplaty. Najdete ho ve zdrojovém kódu systému Git, v souboru `Documentation/SubmittingPatches`.

source: The Git project requires that the more detailed explanation include your motivation for the change and contrast its implementation with previous behavior – this is a good guideline to follow.
cs: Projekt Git vyžaduje, aby podrobnější popis revize zahrnoval i vaši motivaci ke změnám a aby uvedl srovnání nové implementace s původním chováním. Tuto zásadu je dobré dodržovat.

source: The Git server will generally keep the data there for a while until a garbage collection runs, so if it was accidentally deleted, it's often easy to recover.
cs: Gitový server data obecně po nějakou dobu uchovává -- až do doby, kdy se spustí úklid (garbage collection). Takže pokud jste něco nechtěně smazali, dá se to obvykle snadno obnovit.

source: The Git source repo, for instance, contains more than 500 tags.
cs: Například repozitář se zdrojovým kódem systému Git obsahuje více než 500 značek.

source: The Linux kernel is an open source software project of fairly large scope.(((Linux))) For most of the lifetime of the Linux kernel maintenance (1991–2002), changes to the software were passed around as patches and archived files.
cs: Jádro Linuxu je celkem rozsáhlý softwarový open source projekt.(((Linux))) Po většinu životního cyklu údržby jádra Linuxu (1991–2002) se změny přenášely formou záplat a archivních souborů.

source: The Open Source community using Git has also exploded.
cs: Prudký nárůst zaznamenala samotná komunita kolem Open Source, která Git využívá.

source: The Pro Git of four years ago knows about none of that.
cs: V knize Pro Git vydané před čtyřmi lety nenajdete téměř nic, co by s tím souviselo.

source: The SHA-1 digest is 20 bytes or 160 bits.
cs: Otisk SHA-1 má 20 bytů, neboli 160 bitů.

source: The Subversion bridge is the gateway drug to the DVCS world.
cs: Most k systému Subversion je branou do světa DVCS.

source: The `*` next to each file means the file is selected to be staged.
cs: Znak `*` vedle souborů znamená, že je soubor vybrán jako připravený k zapsání.

source: The `--author` option allows you to filter on a specific author, and the `--grep` option lets you search for keywords in the commit messages.
cs: Volba `--author` vám umožní filtrovat výpisy podle zadaného autora, volbou `--grep` můžete ve zprávách k revizi hledat klíčová slova.

source: The `--squash` option takes all the work on the merged branch and squashes it into one changeset producing the repository state as if a real merge happened, without actually making a merge commit.
cs: Volba `--squash` (stlačit) zajistí převzetí všech změn ze začleňované větve a stlačí je do podoby jedné sady změn, která vede ke stejnému stavu repozitáře, jako kdyby se provedlo opravdové sloučení (merge), ale nevytvoří se při tom bod sloučení{empty}footnote:[Pozn. překl.: Nezapíše se tedy revize. Jinými slovy, nevytvoří se žádný objekt revize. Změny budou promítnuté jen to pracovního stromu.] (merge commit).

source: The `--tree-filter` option runs the specified command after each checkout of the project and then recommits the results.
cs: Parametr `--tree-filter` spustí zadaný příkaz po každém checkoutu projektu a znovu zapíše jeho výsledky.

source: The `-M` switch tells Git to look for renames.
cs: Přepínač `-M` řekne systému Git, aby zkontroloval případné přejmenování.

source: The `-T trunk -b branches -t tags` part tells Git that this Subversion repository follows the basic branching and tagging conventions.
cs: Část `-T trunk -b branches -t tags` říká systému Git, že tento repozitář Subversion dodržuje základní zásady větvení a značkování.

source: The `-m` specifies a tagging message, which is stored with the tag.
cs: Parametr `-m` udává zprávu značky, která bude uložena spolu se značkou.

source: The `-w` tells `hash-object` to store the object; otherwise, the command simply tells you what the key would be.
cs: Parametr `-w` sděluje příkazu `hash-object`, aby objekt uložil. Bez parametru by vám příkaz jen sdělil, jaký klíč by byl přidělen.

source: The `.pub` file is your public key, and the other file is your private key.
cs: Soubor `.pub` je váš veřejný klíč, druhý soubor je soukromý klíč.

source: The `Author` information is the individual who originally created the patch and when it was originally created.
cs: Informace `Author` naproti tomu označuje jedince, který patch původně vytvořil, a kdy tak učinil.

source: The `CONTRIBUTING.md` file is modified but once again unstaged.
cs: Soubor `CONTRIBUTING.md` má stav „změněn“, ale už se nenachází v oblasti připravených změn.

source: The `Commit` information indicates the person who applied the patch and the time it was applied.
cs: Informace `Commit` uvádí osobu, která patch aplikovala, a čas, kdy se tak stalo.

source: The `Rakefile` was modified, staged and then modified again, so there are changes to it that are both staged and unstaged.
cs: Soubor `Rakefile` byl změněn, připraven k zápisu a potom znovu změněn, takže se indikuje změna jak pro oblast připravenosti k zápisu, tak pro pracovní strom.

source: The `SHA^@` syntax resolves to all the parents of that commit.
cs: Syntaxe `SHA^@` se vztahuje na všechny rodiče této revize.

source: The ``CONTRIBUTING.md'' file appears under a section named ``Changes not staged for commit'' – which means that a file that is tracked has been modified in the working directory but not yet staged.
cs: Soubor `CONTRIBUTING.md` je uveden v části „Changes not staged for commit“ (změny, které nejsou připraveny k zapsání). Znamená to, že soubor, který je sledován, byl v pracovním adresáři změněn, avšak ještě nebyl připraven k zapsání (staged).

source: The `bisect` command does a binary search through your commit history to help you identify as quickly as possible which commit introduced an issue.
cs: Příkaz `bisect` zahájí binární vyhledávání ve vaší historii revizí a pomůže vám co nejrychleji identifikovat, která revize je původcem problému.

source: The `format-patch` command prints out the names of the patch files it creates.
cs: Příkaz `format-patch` vypíše názvy souborů záplaty, kterou vytváří.

source: The `git branch` command does more than just create and delete branches.(((git commands, branch))) If you run it with no arguments, you get a simple listing of your current branches:
cs: Příkaz `git branch` umí víc, než jen vytvářet a mazat větve.(((git příkazy, branch))) Pokud ho spustíte bez dalších parametrů, získáte prostý výpis všech aktuálních větví:

source: The `git branch` command only _created_ a new branch – it didn't switch to that branch.
cs: Příkaz `git branch` pouze _vytvořil_ novou větev -- nepřepnul do ní.

source: The `git rm` command does that, and also removes the file from your working directory so you don't see it as an untracked file the next time around.
cs: Je k tomu určen příkaz `git rm`, který soubor odstraní také z vašeho pracovního adresáře, takže ho už příště neuvidíte mezi nesledovanými soubory.

source: The `git status` command reminds you:
cs: Připomene vám to příkaz `git status`:

source: The `git verify-pack` plumbing command allows you to see what was packed up:
cs: Nízkoúrovňový příkaz `git verify-pack` umožňuje prohlížet, co bylo zabaleno:

source: The `issue54..origin/master` syntax is a log filter that asks Git to only show the list of commits that are on the latter branch (in this case `origin/master`) that are not on the first branch (in this case `issue54`).
cs: Zápis `issue54..origin/master` předtavuje filtr příkazu, kterým se Gitu říká, aby zobrazil seznam jen těch objektů revize, které se nacházejí v druhé z větví (zde `origin/master`), ale které se nenacházejí v první větvi (zde `issue54`).

source: The `master^{tree}` syntax specifies the tree object that is pointed to by the last commit on your `master` branch.
cs: Syntaxe `master^{tree}` určuje objekt stromu, na nějž ukazuje poslední revize větve `master`.

source: The `master` branch is that of the dictator.
cs: Větev `master` je předmětem zájmu diktátora.

source: The `objects` directory stores all the content for your database, the `refs` directory stores pointers into commit objects in that data (branches), the `HEAD` file points to the branch you currently have checked out, and the `index` file is where Git stores your staging area information.
cs: V adresáři `objects` je uložen celý obsah vaší databáze, v adresáři `refs` jsou uloženy ukazatele na objekty revizí v datech (větve). Soubor `HEAD` ukazuje na větev, na níž se právě nacházíte, a soubor `index` je pro systém Git úložištěm informací o oblasti připravených změn.

source: The `oneline` option prints each commit on a single line, which is useful if you're looking at a lot of commits.
cs: Hodnota `oneline` vypíše všechny revize na jednom řádku, což oceníte při prohlížení velkého množství revizí.

source: The `post-receive` hook runs after the entire process is completed and can be used to update other services or notify users.
cs: Zásuvný modul `post-receive` se spouští až poté, co je celý proces dokončen. Lze ho použít k aktualizaci jiných služeb nebo odeslání oznámení jiným uživatelům.

source: The `pre-commit` hook is run first, before you even type in a commit message.
cs: Zásuvný modul `pre-commit` se spouští jako první, ještě než začnete psát zprávu k revizi.

source: The `pre-rebase` hook runs before you rebase anything and can halt the process by exiting non-zero.
cs: Zásuvný modul `pre-rebase` se spouští před každým přeskládáním a při nenulové hodnotě může tento proces zastavit.

source: The `prepare-commit-msg` hook is run before the commit message editor is fired up but after the default message is created.
cs: Zásuvný modul `prepare-commit-msg` se spouští ještě předtím, než se otevře editor pro vytvoření zprávy k revizi, ale poté, co byla vytvořena výchozí zpráva.

source: The `request-pull` command takes the base branch into which you want your topic branch pulled and the Git repository URL you want them to pull from, and outputs a summary of all the changes you're asking to be pulled in.
cs: Příkazu `request-pull` se zadává základní větev, do které chcete nechat vaši tématickou větev vtáhnout, a URL adresu gitového repozitáře, z kterého se má stahovat. Příkaz vypíše shrnutí všech změn, které by měly být vtaženy.

source: The `send-pack` process runs on the client and connects to a `receive-pack` process on the remote side.
cs: Proces `send-pack` se spouští na klientovi a připojuje se k procesu `receive-pack` na straně vzdáleného serveru.

source: The ability of smaller subgroups of a team to collaborate via remote branches without necessarily having to involve or impede the entire team is a huge benefit of Git.
cs: Možnost spolupráce menších podskupin týmu prostřednictvím vzdálených větví -- aniž by si práce vyžádala účast celého týmu nebo aby bránila ostatním v jiné práci -- patří k obrovským výhodám Gitu.

source: The answer is the HEAD file.
cs: Odpověď zní: soubor HEAD.

source: The answer to this issue is the `git stash` command.
cs: Řešením této situace je odložení (stashing) příkazem `git stash`.

source: The author is the person who originally wrote the work, whereas the committer is the person who last applied the work.
cs: _Autor_ (author) je osoba, která práci původně napsala, zatímco _autor revize_ (committer) je osoba, která tuto práci naposled použila.

source: The base command in Git for all the Subversion bridging commands is `git svn`.
cs: Základním příkazem systému Git ke všem operacím směřujícím do systému Subversion je `git svn`.

source: The basic Git workflow goes something like this:
cs: Základní pracovní postup vypadá v Gitu následovně:

source: The benevolent dictator's repository serves as the reference repository from which all the collaborators need to pull.
cs: Repozitář benevolentního diktátora slouží jako referenční repozitář, z nějž všichni spolupracovníci musí stahovat data.

source: The binary installers tend to be a bit behind, though as Git has matured in recent years, this has made less of a difference.
cs: Binární instalátory bývají trošku pozadu, ačkoli v posledních letech Git vyspěl a rozdíly už nejsou tak významné.

source: The blank line separating the summary from the body is critical (unless you omit the body entirely); tools like rebase can get confused if you run the two together.
cs: Prázdný řádek, který odděluje shrnutí od těla je nezbytně nutný (pokud tělo nevynecháte úplně); nástroje jako rebase mohou být zmatené, pokud tyto části neoddělíte.

source: The blob is now a different blob, which means that although you added only a single line to the end of a 400-line file, Git stored that new content as a completely new object:
cs: Nyní jde o úplně jiný blob. Přestože jste na konec 400řádkového souboru vložili jen jeden jediný řádek, Git uložil nový obsah jako úplně nový objekt:

source: The changes to your files were reapplied, but the file you staged before wasn’t restaged.
cs: Změny byly znovu aplikovány na vaše soubory, ale soubor, který jste předtím připravili k zapsání, nebyl znovu připraven.
